In [3]:
import numpy as np
import pandas as pd
# 存储了 4 个年龄：18/30/25/40
user_age = pd.Series(data=[18, 30, 25, 40])
user_age

0    18
1    30
2    25
3    40
dtype: int64

In [4]:
user_age.index = ["Tom", "Bob", "Mary", "James"]
user_age

Tom      18
Bob      30
Mary     25
James    40
dtype: int64

In [6]:
user_age.index.name = "name"
user_age

name
Tom      18
Bob      30
Mary     25
James    40
Name: user_age_info, dtype: int64

In [7]:
user_age.name="user_age_info"
user_age

name
Tom      18
Bob      30
Mary     25
James    40
Name: user_age_info, dtype: int64

In [8]:
# 构建索引
name = pd.Index(["Tom", "Bob", "Mary", "James"], name="name")
# 构建 Series
user_age = pd.Series(data=[18, 30, 25, 40], index=name, name="user_age_info")
user_age

name
Tom      18
Bob      30
Mary     25
James    40
Name: user_age_info, dtype: int64

In [9]:
# 指定类型为浮点型
user_age = pd.Series(data=[18, 30, 25, 40], index=name, name="user_age_info", dtype=float)
user_age

name
Tom      18.0
Bob      30.0
Mary     25.0
James    40.0
Name: user_age_info, dtype: float64

In [10]:
# 获取 Tom 的年龄
user_age["Tom"]
18.0

18.0

In [12]:
# 获取第一个元素
user_age[0]
18.0

18.0

In [14]:
# 获取前三个元素
user_age[:3]
name

Index(['Tom', 'Bob', 'Mary', 'James'], dtype='object', name='name')

In [15]:
# 获取年龄大于30的元素
user_age[user_age > 30]

name
James    40.0
Name: user_age_info, dtype: float64

In [16]:
user_age[[3, 1]]

name
James    40.0
Bob      30.0
Name: user_age_info, dtype: float64

In [17]:
user_age + 1

name
Tom      19.0
Bob      31.0
Mary     26.0
James    41.0
Name: user_age_info, dtype: float64

In [18]:
np.exp(user_age)

name
Tom      6.565997e+07
Bob      1.068647e+13
Mary     7.200490e+10
James    2.353853e+17
Name: user_age_info, dtype: float64

In [19]:
index = pd.Index(data=["Tom", "Bob", "Mary", "James"], name="name")

data = {
    "age": [18, 30, 25, 40],
    "city": ["BeiJing", "ShangHai", "GuangZhou", "ShenZhen"]
}

user_info = pd.DataFrame(data=data, index=index)
user_info

       age       city
name
Tom     18    BeiJing
Bob     30   ShangHai
Mary    25  GuangZhou
James   40   ShenZhen

In [20]:
data = [[18, "BeiJing"], 
        [30, "ShangHai"], 
        [25, "GuangZhou"], 
        [40, "ShenZhen"]]
columns = ["age", "city"]

user_info = pd.DataFrame(data=data, index=index, columns=columns)
user_info

       age       city
name
Tom     18    BeiJing
Bob     30   ShangHai
Mary    25  GuangZhou
James   40   ShenZhen

In [21]:
#访问行
user_info.loc["Tom"]

age          18
city    BeiJing
Name: Tom, dtype: object

In [22]:
user_info.iloc[0]

age          18
city    BeiJing
Name: Tom, dtype: object

In [23]:
user_info.iloc[1:3]

      age       city
name
Bob    30   ShangHai
Mary   25  GuangZhou

In [24]:
user_info.age

name
Tom      18
Bob      30
Mary     25
James    40
Name: age, dtype: int64

In [27]:
user_info["age"]

name
Tom      18
Bob      30
Mary     25
James    40
Name: age, dtype: int64

In [28]:
#变换列的顺序
user_info[["city", "age"]]

            city  age
name
Tom      BeiJing   18
Bob     ShangHai   30
Mary   GuangZhou   25
James   ShenZhen   40

In [30]:
user_info["sex"] = "male"
user_info

       age       city   sex
name
Tom     18    BeiJing  male
Bob     30   ShangHai  male
Mary    25  GuangZhou  male
James   40   ShenZhen  male

In [31]:
user_info.pop("sex")

name
Tom      male
Bob      male
Mary     male
James    male
Name: sex, dtype: object

In [33]:
user_info["sex"] = ["male", "male", "female", "male"]
user_info

       age       city     sex
name
Tom     18    BeiJing    male
Bob     30   ShangHai    male
Mary    25  GuangZhou  female
James   40   ShenZhen    male

In [34]:
user_info.assign(age_add_one = user_info["age"] + 1)

       age       city     sex  age_add_one
name
Tom     18    BeiJing    male           19
Bob     30   ShangHai    male           31
Mary    25  GuangZhou  female           26
James   40   ShenZhen    male           41

In [35]:
user_info.assign(sex_code = np.where(user_info["sex"] == "male", 1, 0))

       age       city     sex  sex_code
name
Tom     18    BeiJing    male         1
Bob     30   ShangHai    male         1
Mary    25  GuangZhou  female         0
James   40   ShenZhen    male         1